Autodesk.Revit.DB.Structure.TargetHostEdgeAndTransform.GetHostEdgeTransform
Gets the transform that is associated to the host edge's geometry.
Returns:
Returns the transform that is associated to the host edge's geometry.
Since:
2027

Autodesk.Revit.DB.Structure.TargetHostEdgeAndTransform.GetTargetHostEdge
Gets the target host edge.
Returns:
Returns the target host edge.
Since:
2027

Autodesk.Revit.DB.Structure.TargetHostEdgeAndTransform.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.TargetHostEdgeAndTransform
This class stores the target host edge and the transform that is associated to the host edge's geometry.
Since:
2027